{
  "gerado_em": "2026-02-09T08:58:12.055915+00:00",
  "fonte_homepage": "https://castelform.pt",
  "total": 20,
  "acoes": [
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=358&accao=741",
      "id_curso": 358,
      "id_accao": 741,
      "titulo": "0616 - Aplicações informáticas para o processamento de salários",
      "area_formacao": "Gestão e Administração",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a741.jpg",
      "objetivos": [
        "Capaictar os formandos para a utilização de uma aplicação informática da área de gestão de pessoal e para a utilização de base de dados com ligação a outras aplicações.."
      ],
      "conteudos": [
        "Adaptado da UFCD \"Aplicações informáticas de gestão de pessoal\" (UFCD 0616)Legislação LaboralProcessamento salarialAplicações informáticas:",
        "As aplicações informáticas e as organizações",
        "As possibilidades das aplicações informáticasAplicação informática (TOC Online):",
        "Apresentação do software",
        "Módulo de processamento salarial e gestão de RH"
      ],
      "formadores": [
        {
          "nome": "Andrea Braga",
          "biografia": "Licenciatura em Fiscalidade (2007). Contabilista Certificada (desde 2008). Contabilista numa Empresa de contabilidade (desde 2012). Formadora nos Cursos de Técnico/a de Contabilidade; Técnico/a de Apoio à Gestão; Técnicos/as Administrativos; Curso Técnico Especialista em Contabilidade e Fiscalidade; Formadora Certificada e E-Formadora. Formações relevantes: - Técnica Superior Segurança Trabalho (2020) - Gestão administrativa de Recursos Humanos: Rose Specialist (2022); Rose People (2023); - Formação em Ambiente Moodle (2024) e Gestão e Coordenação da Formação (2024)",
          "foto_url": "https://castelform.pt/ficheiros/e14646.jpg"
        }
      ],
      "detalhe": {
        "inicio": "09/02/2026",
        "fim": "25/02/2026"
      },
      "resumo": {
        "horario": "Pós-laboral",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": "Curso inovador de Gestão de Recursos Humanos projetado para capacitar os formandos a utilizar uma aplicação informática ajustada à gestão eficiente de recursos humanos. Neste curso aprenderá a utilizar uma base de dados integrada, que se conecta a outras aplicações, permitindo uma gestão mais eficaz e integrada dos recursos humanos da sua empresa. Com uma abordagem prática e interativa, os formandos desenvolverão competências valiosas que transformarão a forma como gerem as informações sobre gestão de recursos humanos e processamento salarial.",
      "metodologia": "Formato de Formação a Distância (FAD) com sessões síncronas.Sessões Síncronas - das 19:00 às 22:30 h - com todo o grupo de formandos e formadora “on line”, na plataforma ZOOM.Sessões Síncronas de prática simulada, na metodologia de projeto, em que os formandos, de forma individual ou em grupo (em salas individuais ou partilhadas), desenvolvem tarefas e aplicações práticas sugeridas pela formadora, que na segunda fase da sessão dá tutoria aos formandos e orientação pedagógico na execução das propostas de trabalho.",
      "condicoes_inscricao": "Escolaridade mínima:3º ciclo ou 9º ano (completo).Documentação necessária:1. Cópia do cartão de cidadão ou do Visto de Residência, com autorização para trabalho (se candidato/a estrangeiro/a).2. Certificado Escolar ou Certificado de Habilitações Académicas (ou Declaração da instituição de Ensino onde completou, com aproveitamento, o último ano escolar ou do ensino superior, atestando dessa forma as habilitações escolares ou académicas. No caso de candidato/a estrangeiro/a, o certificado de escolaridade ou o certificado de habilitações académicas deve estar reconhecido no sistema de ensino português (seja Escola Secundária, seja Universidade).3. Cópia do último recibo de vencimento (podem ser rasurados os valores auferidos).4. Declaração de Horário de trabalho (ex: de segunda a sexta feira, das 9:00h às 13:00h e das 14:00h às 18:00h).5. IBAN extraído do Netbanking onde deve constar o nome do/a candidato/a.Pagamento do subsídio de alimentação no valor de 6,00 euros/sessão, aos formandos que completem, em cada sessão, pelo menos 3 horas de formação no horário pós-laboral.",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "09/02/2026",
        "09/02/2026",
        "25/02/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Apresentação",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia",
        "Avaliação",
        "Observações"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=368&accao=769",
      "id_curso": 368,
      "id_accao": 769,
      "titulo": "0755 - Processador de texto - funcionalidades avançadas",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a769.jpg",
      "objetivos": [
        "Automatizar tarefas de edição e elaboração de documentos.Efectuar impressões em série.Elaborar e utilizar macros e formulários.."
      ],
      "conteudos": [
        "Modelos e assistentes Criação de modelos Modelos pré",
        "definidos Modelo normal Criação de documentos com recurso a assistentesImpressão em série Documento principal Documento de dadosFormulários Criação de campos de formulários Preenchimento de formuláriosMacros Criação Gravação Execução"
      ],
      "formadores": [],
      "detalhe": {
        "inicio": "09/02/2026",
        "fim": "02/03/2026"
      },
      "resumo": {
        "horario": "19:30-22:30 (com 2 sessões das 19:30 às 23:00)",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=62&accao=800",
      "id_curso": 62,
      "id_accao": 800,
      "titulo": "Conduzir e Operar com o trator em Segurança (COTS) (UFCD 9596)",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a800.jpg",
      "objetivos": [
        "Complementar os conhecimentos teóricos e práticos dos participantes sobre a condução e operação de tratores em segurança tendo em vista a melhoria do seu desempenho na via pública e na exploração e a redução da sinistralidade.."
      ],
      "conteudos": [
        "Acidentes com tratores em Portugal:",
        "Caraterização geral",
        "dados estatísticos",
        "Acidentes e mortalidade na via pública",
        "incidência, tipo de acidentes e principais causas",
        "Acidentes e mortalidade na exploração",
        "incidência, tipo de acidentes e principais causasCondução e prevenção rodoviária com veículos agrícolas",
        "Código da Estrada, Código do trabalho e Normas aplicáveis:",
        "Habilitação para a condução de tratores agrícolas",
        "Princípios gerais de trânsito e de segurança rodoviária",
        "Condutor e o seu estado físico e psicológico",
        "Condutor e o veículo",
        "Condutor e os outros utentes da via",
        "Condutor, a via e os outros fatores externos",
        "Condutor e o conhecimento do veiculo, aptidões e comportamentos",
        "Legislação aplicávelVeículo seguro",
        "equipamento de segurança e proteção do trator:",
        "Homologação",
        "Declaração CE de Conformidade. Marcação CE. Manual de instruções",
        "Manual de instruções – consulta, verificações e manutenções periódicas do veículo",
        "Estruturas de proteção",
        "cabine, quadro, arco de S. António",
        "Sistema de retenção e cinto de segurança",
        "Protetores de órgãos ativos e quentes",
        "Extintor",
        "Sinalização luminosa rotativa",
        "Espelhos retrovisores",
        "Caixa de primeiros socorrosEquipamento de proteção individual:",
        "Descrição, características e função de cada elemento de proteção",
        "Cuidados particulares com o vestuário a usar em função das máquinas a operarCondução e operação com o trator em segurança:",
        "Principais mandamentos de segurança com o trator",
        "Cuidados a ter antes de acionar e começar a trabalhar e no acesso ao trator",
        "Posição do operador para conduzir o trator ou operar comandos periféricos",
        "Cuidados a ter com o trator acionado",
        "Cuidados a ter na condução do trator, adequada às do tráfego, do piso e das condições climatéricas",
        "Cuidados a ter com outras pessoas",
        "Cuidados a ter no engate de máquinas e alfaias aos três pontos do hidráulico",
        "Cuidados a ter no engate do reboque e dispositivos de segurança",
        "Condução do trator na via publica – sem e com reboque, sem e com maquinas montadas, semi",
        "montadas ou rebocadas",
        "Cuidados a ter para evitar o reviramento ou o capotamento do tratorCondução do trator em condições perigosas e operar com orgãos ativos:",
        "Condução e operação em terreno acidentado",
        "Condução e operação do trator com carregador frontal",
        "Condução e operação do trator com reboque carregado e descarregado",
        "Cuidados a ter com o uso da báscula do reboque",
        "Operação com a TDF (tomada de força) – sistemas mecânicos de segurança para o veio e, de proteção para o operador",
        "Operação com o sistema hidráulico",
        "Velocidade no trator adequada às condições do piso e das condições climatéricas",
        "Travagem do trator; utilização do sistema de travagem; combinação da travagem com a utilização da caixa de velocidades",
        "Respeito pelas distâncias de segurança relativamente a cômoros, valas e precipíciosBoas práticas de segurança na condução, operação e engate/desengate de reboques e semi",
        "reboques e outras máquinas agrícolas e saúde no trabalho agrícola"
      ],
      "formadores": [],
      "detalhe": {
        "inicio": "09/02/2026",
        "fim": "02/03/2026"
      },
      "resumo": {
        "horario": "Dias úteis (18:30-22:30) + Sábados e 1 dia útil (9:00-17:00)",
        "local": "Armamar - Telheira - Produção de Frutas, Lda (Estrada Nacional 226, nº2)"
      },
      "apresentacao": null,
      "metodologia": "Ativa, Centrada no participante, baseada na experiência e participação dos formandos, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de caso, trabalho individual e de grupo. A formação prática será realizada em campo.",
      "condicoes_inscricao": "Apresentar a seguinte documentação na fase de inscrição:1- Cópia do Certificado de Escolaridade ou de Habilitações Académicas2- Comprovativo de situação profissional: a) Recibo de Vencimento do ultimo mês (se trabalhadores por conta de outrem) b) Declaração de Inicio de Atividade + RVE ou Fatura recente (se trabalhadores por conta própria)Declaração do IEFP em como se encontra desempregado/a e inscrito/a à procura de emprego ou, em alternativa, com comprovativo da Segurança Social em como está desempregado (pode ser obtido via Segurança Social Direta - PDF de Extrato de Remunerações). 3- Cópia da Carta de Condução que habilite à Condução de Veículos Agrícolas (Carta de ligeiros ou pesados)4- Cópia do Cartão de CidadãoOutras condições de inscrição e seleção:N.º de formandos máximo: 16Idade: = 18 anos Habilitações literárias:. Escolaridade obrigatória, nos termos dos n.º 3 do artigo 7.º, do Anexo do Despacho n.º 5756/2020, de 26 de maio.. De acordo com alínea b1) do n.º 3, do artigo 7.º, do Anexo, do referido despacho, podem ser ainda aceites formandos que não disponham de escolaridade obrigatória, desde que comprovem saber ler, escrever e interpretar um texto.Outros requisitos:. Carta de condução da Categoria B, C ou D;. Título de condução que habilite a conduzir veículos agrícolas, quando o seu titular pretenda atualizar conhecimentos.",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "Semana 109-02-2026 - 2ª feira - 18:30 - 22:30 - 4.0 H10-02-2026 - 3ª feira - 18:30 - 22:30 - 4.0 H13-02-2026 - 6ª feira - 18:30 - 22:00 - 3.5 H14-02-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 216-02-2026 - 2ª feira - 18:30 - 22:30 - 4.0 H20-02-2026 - 6ª feira - 18:30 - 22:00 - 3.5 H21-02-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 327-02-2026 - 6ª feira - 18:30 - 21:30 - 3.0 H28-02-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 402-03-2026 - 2ª feira - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 H"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=379&accao=794",
      "id_curso": 379,
      "id_accao": 794,
      "titulo": "10794 - Programação avançada com Python",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a794.jpg",
      "objetivos": [
        "Capacitar os formandos a criar soluções de alta complexidade utilizando Python, aprofundando conhecimentos em estruturas avançadas da linguagem, boas práticas de desenvolvimento, programação orientada a objetos, integração com bibliotecas especializadas e construção de aplicações robustas, eficientes e escaláveis para diferentes contextos profissionais.."
      ],
      "conteudos": [
        "Tratamento idiomático de dados Comparação de operadores em cadeia Indentação Falsy Truthy Equivalente ao operador ternário Palavra reservada “in” Uso do retorno na avaliação de expressões Formatação de strings Expressões LambdaClasses e Objetos Criação de classes Privados vs públicos Herança Métodos estáticosSerialization e deserialization de objetos em PythonTeste, registo e depuraçãoCriação de livrarias e distribuição de programas em PythonÂmbito em funçõesMetaprogramação, programação dinâmica Metaclasses Código a gerar códigoIteradores, Geradores e Co",
        "rotinas Método iter() Looping Como criar iteradores Geradores Método __next_()Desenvolvimento para a web em Python Django ou Flask Criação de webservices Acesso a dado"
      ],
      "formadores": [
        {
          "nome": "Ricardo Mourão",
          "biografia": "Licenciado em Criminologia pelo Instituto Universitário da Maia - ISMAI (2010-2013). Fundador e CEO da Crime&Lógica (desde 2019) e da (desde 2020), focadas em soluções inovadoras em criminologia, desenvolvimento web e marketing digital. Formador (desde 2020) em programação (Python, C/C++, JavaScript, PHP), engenharia de software e literacia digital. Entusiasta de IA e programação, com experiência de docência no Instituto Português de Criminologia.",
          "foto_url": "https://castelform.pt/ficheiros/e16338.jpg"
        }
      ],
      "detalhe": {
        "inicio": "10/02/2026",
        "fim": "02/04/2026"
      },
      "resumo": {
        "horario": "Pós laboral das 19h30-22h30",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": "Prepare-se para o Futuro da Análise de Dados! Neste curso prático e dinâmico, fica capacitado a manipular e transformar dados de forma eficiente utilizando a poderosa linguagem Python. O curso aborda desde a importação de dados até a criação de variáveis personalizadas, passando por operações de limpeza e transformação.",
      "metodologia": "Formação a distância (totalmente \"on line\").Utilização do método demonstrativo nas sessões síncronas (on line) com execução de exercícios práticos/atividades colocados na plataforma e que os formandos descarregam para os seus PCs no inicio de cada sessão e/ou nova atividade. Havendo autorização dos formandos, as sessões de formação são gravadas e os vídeos disponibilizados após cada sessãsão. Desta forma, os vídeos são recrusos pedagógicos de apoio cuja visualização permite aos formandos repetir o exercício/atividade e desta forma ir consolidando as funcionalidades e rotinas de progrmação com Python a fim de que no final consigam a produção de dashboards e relatórios analíticos mais atrativos e informativos.",
      "condicoes_inscricao": "Escolaridade mínima:12º ano (completo).Documentação necessária:1. Cópia do cartão de cidadão ou do Visto de Residência, com autorização para trabalho (se candidato/a estrangeiro/a).2. Certificado Escolar ou Certificado de Habilitações Académicas (ou Declaração da instituição de Ensino onde completou, com aproveitamento, o último ano escolar ou do ensino superior, atestando dessa forma as habilitações escolares ou académicas. No caso de candidato/a estrangeiro/a, o certificado de escolaridade ou o certificado de habilitações académicas deve estar reconhecido no sistema de ensino português (seja Escola Secundária, seja Universidade).3. Cópia do último recibo de vencimento (podem ser rasurados os valores auferidos).4. Declaração de Horário de trabalho (ex: de segunda a sexta feira, das 9:00h às 13:00h e das 14:00h às 18:00h).5. IBAN extraído do Netbanking onde deve constar o nome do/a candidato/a.Pagamento do subsídio de alimentação no valor de 6,00 euros/sessão, aos formandos que completem, em cada sessão, pelo menos 3 horas de formação no horário pós-laboral.",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "10/02/2026",
        "10/02/2026",
        "02/04/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Apresentação",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Objetivos Específicos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=75&accao=778",
      "id_curso": 75,
      "id_accao": 778,
      "titulo": "Poda e enxertia em fruticultura (UFCD 6352)",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a778.jpg",
      "objetivos": [],
      "conteudos": [
        "Conceitos básicos de poda",
        "Épocas adequadas para a realização da poda",
        "Material de poda",
        "Formas de condução e densidade",
        "Tipos de poda e relação com os hábitos de frutificação das variedades",
        "Poda de formação",
        "Poda de frutificação/renovação",
        "Técnicas de corte, proteção das feridas e sua cicatrização",
        "Poda em verde e época de realização",
        "Intensidade da poda",
        "Monda de frutos, época de realização e técnicas utilizadas",
        "Diferentes sistemas de condução",
        "Relação entre o tipo de poda e o sistema de condução",
        "Execução dos diferentes tipos de poda, de acordo com o estado vegetativo, sanidade e sistema de condução escolhido"
      ],
      "formadores": [
        {
          "nome": "Carlos Manuel da Cunha Carvalho Marques",
          "biografia": "Licenciado em Engenharia Agronómica e Mestre em Enologia e Viticultura. Atualmente presta consultoria a explorações agrícolas nas operações de tratamentos fitossanitários e na calibração e inspeção de equipamentos de pulverização. Ministrou várias formções na área agricola e florestal, nomeadamente as UFCD's 4552, 9998, COTS (35h/50h), ADCAPF e APF.",
          "foto_url": "https://castelform.pt/ficheiros/e11547.jpg"
        }
      ],
      "detalhe": {
        "inicio": "12/02/2026",
        "fim": "26/02/2026"
      },
      "resumo": {
        "horario": "Pós laboral",
        "local": "Junta de Freguesia de Arentim e Cunha (Braga)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "NOVAS DATAS:Semana 112-02-2026 - 5ª feira - 19:00 - 22:30 - 3,5 H13-02-2026 - 6ª feira - 19:00 - 22:30 - 3.5 H14-02-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 216-02-2026 - 2ª feira - 19:00 - 22:30 - 3.5 H18-02-2026 - 4ª feira - 19:00 - 22:30 - 3.5 H20-02-2026 - 6ª feira - 19:00 - 22:30 - 3.5 H21-02-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 323-02-2026 - 2ª feira - 19:00 - 22:30 - 3.5 H26-02-2026 - 5ª feira - 19:00 - 22:30 - 3.5 H"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Área de Formação",
        "Objetivos Específicos",
        "Conteúdos Programáticos",
        "Formador(es)"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=365&accao=766",
      "id_curso": 365,
      "id_accao": 766,
      "titulo": "Power BI (Avançado)",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c365.jpg",
      "objetivos": [
        "-Transformar dados e criar métricas.-Interpretar a linguagem Data Analysis Expressions (DAX).."
      ],
      "conteudos": [
        "Introdução à transformação de dados",
        "Transformação de dados",
        "Função Calculate",
        "Relações eficazmente",
        "Medidas semi",
        "aditivas",
        "Introdução ao DAX no Power BI Desktop",
        "Inteligência de Tempo e Medidas em DAX",
        "Introdução à otimização de desempenho",
        "Desempenho de medidas, relacionamentos e visuais",
        "Variáveis para melhorar o desempenho e a resolução de problemas",
        "Redução de cardinalidade",
        "Otimização dos modelos DirectQuery com armazenamento ao nível da tabela",
        "Criação de gestão de agregações"
      ],
      "formadores": [
        {
          "nome": "Ricardo Dias",
          "biografia": "(n. 1971). Bacharelato em Gestão Informática - Ramo Informática de Gestão (Instituto Politécnico da Guarda). ECDL – Carta Europeia de Condução em Informática. Foi sócio-gerente e fundador da Empresa especializada no desenvolvimento da Plataforma Mestreclique - Gestão Integrada de Formação/ Consultoria. Atualmente é Formador e Consultor em Sistemas de Informação, com predominância na Plataforma Mestreclique, Excel e Power BI e ainda formação-ação para empresas",
          "foto_url": "https://castelform.pt/ficheiros/e87.jpg"
        }
      ],
      "detalhe": {
        "inicio": "16/02/2026",
        "fim": "09/03/2026"
      },
      "resumo": {
        "horario": "19:30-23:00",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "16/02/2026",
        "09/03/2026",
        "16/02/2026",
        "09/03/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=2&accao=793",
      "id_curso": 2,
      "id_accao": 793,
      "titulo": "Processos e métodos de proteção fitossanitária e de aplicação de produtos fitofarmacêuticos - UFCD 6281",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c2.jpg",
      "objetivos": [
        "Capacitar os participantes para a manipulação e aplicação segura de produtos fitofarmacêuticos, minimizando os riscos para o aplicador, o ambiente, espécies e organismos não visados e o consumidor, de acordo com os princípios da protecção integrada.."
      ],
      "conteudos": [
        "Introdução ao curso 1. Apresentação do grupo 2. Levantamento de expectativas dos participantes 3. Apresentação do programa de acção BLOCO I",
        "Princípios gerais de proteção das culturasI.1 Meios de protecção das culturas",
        "controlo de doenças, pragas e infestantes I.1.1. Luta biológica I.1.2. Luta cultural I.1.3. Luta genética I.1.4. Luta biotécnica I.1.5. Luta química I.2 Proteção integrada I.2.1. Evolução da protecção das plantas I.2.2. Legislação específica I.2.3. Princípios gerais de proteção integrada I.2.4. Estimativa do risco e modelos de previsão I.2.5. Nível económico de ataque (NEA) I.2.6. Tomada de decisão I.2.7. Luta química",
        "Seleção de produtos fitofarmacêuticos I.2.8. Registo dos tratamentos realizados (caderno de campo) I.3 Produção integrada I.3.1. Princípios da PRODI I.3.2. Estratégia de produção I.3.3. Principais técnicas de produção I.3.4. Regulamentação e registosI.4 Agricultura biológica I.4.1. Princípios gerais I.4.2. Regulamento Comunitário relativo à Agricultura Biológica BLOCO II",
        "Segurança na utilização de produtos fitofarmacêuticos, sistemas regulamentares e redução do risco II.1 Produtos fitofarmacêiticos II.1.1. Definição de produto fitofarmacêutico II.1.2. Classificação química II.1.3. Modos de ação II.1.4. Formulação II.2 Sistemas regulamentares dos PF II.2.1. Homologação dos produtos fitofarmacêuticos II. 2.2. Produtos ilegais",
        "sua identificação II.2.3. Distribuição, venda e aplicação II.2.4. Gestão de resíduos de embalagens e de excedentes II.2.5. Outra legislação aplicável ou complementar II.3. Segurança na utilização dos produtos fitofarmacêuticos II.3.1. Aspetos toxicológicos inerentes à manipulação e aplicação dos produtos fitofarmacêuticos II.3.2. Símbolos toxicológicos e ecotoxicológicos II.3.3. Informação e leitura do rótulo II.3.4. Equipamento de proteção individual (EPI) II.3.5. Relação entre o EPI e as diferentes características dos produtos fitofarmacêuticos II.3.6. Sintomas de intoxicação com produtos fitofarmacêuticos II.4 Redução do risco no manuseamento e aplicação de produtos fitofarmacêuticos II.4.1. Verificação das condições de trabalho, condições atmosféricas, material de aplicação a utilizar, leitura do rótulo II.4.2. Cuidados com a preparação da calda II.4.3. Noção de dose e de concentração da calda II.4.4. Utilização do EPI correcto II.4.5. Boas práticas de segurança e saúde no trabalho II.5 Redução do risco para o ambiente, espécies e organismos não visados II.5.1. Impacte no ambiente do uso de produtos fitofarmacêuticos II.5.2. Riscos para as espécies e os organismos não visados resultantes da aplicação dos produtos fitofarmacêuticos II.5.3. Preparação da calda II.5.4. Eliminação de excedentes de calda II.5.5. Lavagem do equipamento de aplicação II.5.6. Gestão de embalagens e produtos obsoletos II.5.7. Boas práticas de segurança e saúde no trabalho II.6 Redução do risco para o consumidor II.6.1. Noção de resíduo II.6.2. Limite Máximo de Resíduo II.6.3. Intervalo de segurança II.6.4. Exposição do consumidor e cumprimento das indicações do rótulo II.6.5. Controlo de resíduos BLOCO III",
        "Máquinas de aplicação de produtos fitofarmacêuticos e técnicas de aplicaçãoIII.1. Máquinas de aplicação",
        "pulverizadores, atomizadores e polvilhadores III.1.1. Tipos, constituição e funcionamento III.1.2. Equipamentos combinados de mobilização, sementeira e tratamento fitossanitário III.1.3. Critérios para a seleção das máquinas de aplicação III.1.4. Engate das máquinas ao trator e regulações comuns III.1.5. Inspeção do equipamento e verificação do estado de funcionamento III.1.6. Técnicas de calibração e regulação das máquinas de aplicação III.1.7. Limpeza, conservação e manutenção do material de aplicação III.1.8. Operações de engate ao trator e regulação, de calibração e regulação de máquinas de aplicação e de limpeza, conservação e manutenção III.1.9. Boas práticas de segurança e saúde no trabalhoIII.2. Preparação da calda e técnicas de aplicação III.2.1. Cálculo de doses, concentrações e volumes de calda com herbicidas, inseticidas, fungicidas e outros produtos fitofarmacêuticos III.2.2. Preparação da calda III.2.3. Técnicas de aplicação III.2.4. Arrastamento da calda III.2.5. Cuidados com o equipamento após aplicação III.2.6. Eliminação de excedentes de calda e de embalagens III.2.7. Operações de aplicação de PF III.2.8. Boas práticas de segurança e saúde no trabalho BLOCO IV",
        "Armazenamento, transporte e acidentes com produtos fitofarmacêuticosIV.1 Armazenamento e transporte de pequenas quantidades de produtos fitofarmacêuticos IV.1.1. Condições e características dos locais de armazenamento de produtos fitofarmacêuticos IV.1.2. Perigos e segurança durante o armazenamento. Sinalização. IV.1.3. Perigos e segurança no transporte de pequenas quantidades de produtos fitofarmacêuticos IV.2 Acidentes com produtos fitofarmacêuticos IV.2.1. Prevenção de acidentes IV.2.2. Acidentes de trabalho IV.2.3. Medidas de primeiros socorros Avaliação e encerramentoAvaliação de conhecimentos Avaliação de conhecimentos",
        "Prova teórica escritaAvaliação de reação e encerramento Avaliação de reação Encerramento"
      ],
      "formadores": [],
      "detalhe": {
        "inicio": "17/02/2026",
        "fim": "17/03/2026"
      },
      "resumo": {
        "horario": "Pós-Laboral (18:30-22:30 Sábado - 09:00-17:00)",
        "local": "Fradelos - Braga"
      },
      "apresentacao": null,
      "metodologia": "Activa, centrada no participante, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de casos e trabalhos de grupo",
      "condicoes_inscricao": "Idade igual ou superior a 18 anos;Escolaridade mínima obrigatória; Situação Profissional:Activos: trabalhadores por conta de outrém, trabalhadores por conta própria ou em situação de desemprego que exercem actividade agrícola a tempo inteiro ou parcial (agricultores empresários e não empresários, trabalhadores agrícolas permanentes e eventuais, mão de obra agrícola familiar) Outros critérios:Exercer ou vir a exercer actividade relacionada com a aplicação de produtos fitofarmacêuticos",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Metodologia",
        "Observações"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=2&accao=810",
      "id_curso": 2,
      "id_accao": 810,
      "titulo": "Processos e métodos de proteção fitossanitária e de aplicação de produtos fitofarmacêuticos - UFCD 6281",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c2.jpg",
      "objetivos": [
        "Capacitar os participantes para a manipulação e aplicação segura de produtos fitofarmacêuticos, minimizando os riscos para o aplicador, o ambiente, espécies e organismos não visados e o consumidor, de acordo com os princípios da protecção integrada.."
      ],
      "conteudos": [
        "Introdução ao curso 1. Apresentação do grupo 2. Levantamento de expectativas dos participantes 3. Apresentação do programa de acção BLOCO I",
        "Princípios gerais de proteção das culturasI.1 Meios de protecção das culturas",
        "controlo de doenças, pragas e infestantes I.1.1. Luta biológica I.1.2. Luta cultural I.1.3. Luta genética I.1.4. Luta biotécnica I.1.5. Luta química I.2 Proteção integrada I.2.1. Evolução da protecção das plantas I.2.2. Legislação específica I.2.3. Princípios gerais de proteção integrada I.2.4. Estimativa do risco e modelos de previsão I.2.5. Nível económico de ataque (NEA) I.2.6. Tomada de decisão I.2.7. Luta química",
        "Seleção de produtos fitofarmacêuticos I.2.8. Registo dos tratamentos realizados (caderno de campo) I.3 Produção integrada I.3.1. Princípios da PRODI I.3.2. Estratégia de produção I.3.3. Principais técnicas de produção I.3.4. Regulamentação e registosI.4 Agricultura biológica I.4.1. Princípios gerais I.4.2. Regulamento Comunitário relativo à Agricultura Biológica BLOCO II",
        "Segurança na utilização de produtos fitofarmacêuticos, sistemas regulamentares e redução do risco II.1 Produtos fitofarmacêiticos II.1.1. Definição de produto fitofarmacêutico II.1.2. Classificação química II.1.3. Modos de ação II.1.4. Formulação II.2 Sistemas regulamentares dos PF II.2.1. Homologação dos produtos fitofarmacêuticos II. 2.2. Produtos ilegais",
        "sua identificação II.2.3. Distribuição, venda e aplicação II.2.4. Gestão de resíduos de embalagens e de excedentes II.2.5. Outra legislação aplicável ou complementar II.3. Segurança na utilização dos produtos fitofarmacêuticos II.3.1. Aspetos toxicológicos inerentes à manipulação e aplicação dos produtos fitofarmacêuticos II.3.2. Símbolos toxicológicos e ecotoxicológicos II.3.3. Informação e leitura do rótulo II.3.4. Equipamento de proteção individual (EPI) II.3.5. Relação entre o EPI e as diferentes características dos produtos fitofarmacêuticos II.3.6. Sintomas de intoxicação com produtos fitofarmacêuticos II.4 Redução do risco no manuseamento e aplicação de produtos fitofarmacêuticos II.4.1. Verificação das condições de trabalho, condições atmosféricas, material de aplicação a utilizar, leitura do rótulo II.4.2. Cuidados com a preparação da calda II.4.3. Noção de dose e de concentração da calda II.4.4. Utilização do EPI correcto II.4.5. Boas práticas de segurança e saúde no trabalho II.5 Redução do risco para o ambiente, espécies e organismos não visados II.5.1. Impacte no ambiente do uso de produtos fitofarmacêuticos II.5.2. Riscos para as espécies e os organismos não visados resultantes da aplicação dos produtos fitofarmacêuticos II.5.3. Preparação da calda II.5.4. Eliminação de excedentes de calda II.5.5. Lavagem do equipamento de aplicação II.5.6. Gestão de embalagens e produtos obsoletos II.5.7. Boas práticas de segurança e saúde no trabalho II.6 Redução do risco para o consumidor II.6.1. Noção de resíduo II.6.2. Limite Máximo de Resíduo II.6.3. Intervalo de segurança II.6.4. Exposição do consumidor e cumprimento das indicações do rótulo II.6.5. Controlo de resíduos BLOCO III",
        "Máquinas de aplicação de produtos fitofarmacêuticos e técnicas de aplicaçãoIII.1. Máquinas de aplicação",
        "pulverizadores, atomizadores e polvilhadores III.1.1. Tipos, constituição e funcionamento III.1.2. Equipamentos combinados de mobilização, sementeira e tratamento fitossanitário III.1.3. Critérios para a seleção das máquinas de aplicação III.1.4. Engate das máquinas ao trator e regulações comuns III.1.5. Inspeção do equipamento e verificação do estado de funcionamento III.1.6. Técnicas de calibração e regulação das máquinas de aplicação III.1.7. Limpeza, conservação e manutenção do material de aplicação III.1.8. Operações de engate ao trator e regulação, de calibração e regulação de máquinas de aplicação e de limpeza, conservação e manutenção III.1.9. Boas práticas de segurança e saúde no trabalhoIII.2. Preparação da calda e técnicas de aplicação III.2.1. Cálculo de doses, concentrações e volumes de calda com herbicidas, inseticidas, fungicidas e outros produtos fitofarmacêuticos III.2.2. Preparação da calda III.2.3. Técnicas de aplicação III.2.4. Arrastamento da calda III.2.5. Cuidados com o equipamento após aplicação III.2.6. Eliminação de excedentes de calda e de embalagens III.2.7. Operações de aplicação de PF III.2.8. Boas práticas de segurança e saúde no trabalho BLOCO IV",
        "Armazenamento, transporte e acidentes com produtos fitofarmacêuticosIV.1 Armazenamento e transporte de pequenas quantidades de produtos fitofarmacêuticos IV.1.1. Condições e características dos locais de armazenamento de produtos fitofarmacêuticos IV.1.2. Perigos e segurança durante o armazenamento. Sinalização. IV.1.3. Perigos e segurança no transporte de pequenas quantidades de produtos fitofarmacêuticos IV.2 Acidentes com produtos fitofarmacêuticos IV.2.1. Prevenção de acidentes IV.2.2. Acidentes de trabalho IV.2.3. Medidas de primeiros socorros Avaliação e encerramentoAvaliação de conhecimentos Avaliação de conhecimentos",
        "Prova teórica escritaAvaliação de reação e encerramento Avaliação de reação Encerramento"
      ],
      "formadores": [
        {
          "nome": "Eliana Pamela Antunes Barbosa",
          "biografia": "Doutoramento em Produção e Sanidade Animal pela Faculdade de Veterinária da Universidade de León e Licenciatura em Engenharia Agrária Ramo-Agropecuária pela Escola Superior Agrária de Ponte de Lima (IPVC). Docente no Ensino Superior e Profissional. Formadora na área das Ciências Agrárias, com formação creditada pela DGERT como E-formador/E-Tutor. Participou em projetos de investigação científica e de desenvolvimento nacionais e internacionais.",
          "foto_url": "https://castelform.pt/ficheiros/e0.jpg"
        },
        {
          "nome": "Gracinda Alves",
          "biografia": "(n. 1980) . Licenciatura em Engenharia Agronómica, Ramo Zootecnia. Professora do ensino profissional agrícola na temática de mecanização e colaboradora em exploração agrícola familiar. Formadora em cursos de zootecnia, produção agícola e mecanização agrícola. Possui formação específica em mecanização agrícola estando homologada pela DRAPN para ministrar cursos de Condução e Operação com o Trator em Segurança (COTs)",
          "foto_url": "https://castelform.pt/ficheiros/e3759.jpg"
        }
      ],
      "detalhe": {
        "inicio": "18/02/2026",
        "fim": "07/03/2026"
      },
      "resumo": {
        "horario": "2ª a 6ª das 18:30 às 22:30 / Sábado e Domingo das 09:00 às 17:00",
        "local": "Arco de Baúlhe"
      },
      "apresentacao": null,
      "metodologia": "Activa, centrada no participante, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de casos e trabalhos de grupo",
      "condicoes_inscricao": "Idade igual ou superior a 18 anos;Escolaridade mínima obrigatória; Situação Profissional:Activos: trabalhadores por conta de outrém, trabalhadores por conta própria ou em situação de desemprego que exercem actividade agrícola a tempo inteiro ou parcial (agricultores empresários e não empresários, trabalhadores agrícolas permanentes e eventuais, mão de obra agrícola familiar) Outros critérios:Exercer ou vir a exercer actividade relacionada com a aplicação de produtos fitofarmacêuticos",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=308&accao=770",
      "id_curso": 308,
      "id_accao": 770,
      "titulo": "9188 - Fundamentos de cibersegurança",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a770.jpg",
      "objetivos": [],
      "conteudos": [],
      "formadores": [],
      "detalhe": {
        "inicio": "18/02/2026",
        "fim": "11/03/2026"
      },
      "resumo": {
        "horario": "Pós laboral (19h30-23h00 e 19h30-23h30)",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "18/02/2026",
        "18/02/2026",
        "11/03/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Área de Formação"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=2&accao=817",
      "id_curso": 2,
      "id_accao": 817,
      "titulo": "Processos e métodos de proteção fitossanitária e de aplicação de produtos fitofarmacêuticos - UFCD 6281",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c2.jpg",
      "objetivos": [
        "Capacitar os participantes para a manipulação e aplicação segura de produtos fitofarmacêuticos, minimizando os riscos para o aplicador, o ambiente, espécies e organismos não visados e o consumidor, de acordo com os princípios da protecção integrada.."
      ],
      "conteudos": [
        "Introdução ao curso 1. Apresentação do grupo 2. Levantamento de expectativas dos participantes 3. Apresentação do programa de acção BLOCO I",
        "Princípios gerais de proteção das culturasI.1 Meios de protecção das culturas",
        "controlo de doenças, pragas e infestantes I.1.1. Luta biológica I.1.2. Luta cultural I.1.3. Luta genética I.1.4. Luta biotécnica I.1.5. Luta química I.2 Proteção integrada I.2.1. Evolução da protecção das plantas I.2.2. Legislação específica I.2.3. Princípios gerais de proteção integrada I.2.4. Estimativa do risco e modelos de previsão I.2.5. Nível económico de ataque (NEA) I.2.6. Tomada de decisão I.2.7. Luta química",
        "Seleção de produtos fitofarmacêuticos I.2.8. Registo dos tratamentos realizados (caderno de campo) I.3 Produção integrada I.3.1. Princípios da PRODI I.3.2. Estratégia de produção I.3.3. Principais técnicas de produção I.3.4. Regulamentação e registosI.4 Agricultura biológica I.4.1. Princípios gerais I.4.2. Regulamento Comunitário relativo à Agricultura Biológica BLOCO II",
        "Segurança na utilização de produtos fitofarmacêuticos, sistemas regulamentares e redução do risco II.1 Produtos fitofarmacêiticos II.1.1. Definição de produto fitofarmacêutico II.1.2. Classificação química II.1.3. Modos de ação II.1.4. Formulação II.2 Sistemas regulamentares dos PF II.2.1. Homologação dos produtos fitofarmacêuticos II. 2.2. Produtos ilegais",
        "sua identificação II.2.3. Distribuição, venda e aplicação II.2.4. Gestão de resíduos de embalagens e de excedentes II.2.5. Outra legislação aplicável ou complementar II.3. Segurança na utilização dos produtos fitofarmacêuticos II.3.1. Aspetos toxicológicos inerentes à manipulação e aplicação dos produtos fitofarmacêuticos II.3.2. Símbolos toxicológicos e ecotoxicológicos II.3.3. Informação e leitura do rótulo II.3.4. Equipamento de proteção individual (EPI) II.3.5. Relação entre o EPI e as diferentes características dos produtos fitofarmacêuticos II.3.6. Sintomas de intoxicação com produtos fitofarmacêuticos II.4 Redução do risco no manuseamento e aplicação de produtos fitofarmacêuticos II.4.1. Verificação das condições de trabalho, condições atmosféricas, material de aplicação a utilizar, leitura do rótulo II.4.2. Cuidados com a preparação da calda II.4.3. Noção de dose e de concentração da calda II.4.4. Utilização do EPI correcto II.4.5. Boas práticas de segurança e saúde no trabalho II.5 Redução do risco para o ambiente, espécies e organismos não visados II.5.1. Impacte no ambiente do uso de produtos fitofarmacêuticos II.5.2. Riscos para as espécies e os organismos não visados resultantes da aplicação dos produtos fitofarmacêuticos II.5.3. Preparação da calda II.5.4. Eliminação de excedentes de calda II.5.5. Lavagem do equipamento de aplicação II.5.6. Gestão de embalagens e produtos obsoletos II.5.7. Boas práticas de segurança e saúde no trabalho II.6 Redução do risco para o consumidor II.6.1. Noção de resíduo II.6.2. Limite Máximo de Resíduo II.6.3. Intervalo de segurança II.6.4. Exposição do consumidor e cumprimento das indicações do rótulo II.6.5. Controlo de resíduos BLOCO III",
        "Máquinas de aplicação de produtos fitofarmacêuticos e técnicas de aplicaçãoIII.1. Máquinas de aplicação",
        "pulverizadores, atomizadores e polvilhadores III.1.1. Tipos, constituição e funcionamento III.1.2. Equipamentos combinados de mobilização, sementeira e tratamento fitossanitário III.1.3. Critérios para a seleção das máquinas de aplicação III.1.4. Engate das máquinas ao trator e regulações comuns III.1.5. Inspeção do equipamento e verificação do estado de funcionamento III.1.6. Técnicas de calibração e regulação das máquinas de aplicação III.1.7. Limpeza, conservação e manutenção do material de aplicação III.1.8. Operações de engate ao trator e regulação, de calibração e regulação de máquinas de aplicação e de limpeza, conservação e manutenção III.1.9. Boas práticas de segurança e saúde no trabalhoIII.2. Preparação da calda e técnicas de aplicação III.2.1. Cálculo de doses, concentrações e volumes de calda com herbicidas, inseticidas, fungicidas e outros produtos fitofarmacêuticos III.2.2. Preparação da calda III.2.3. Técnicas de aplicação III.2.4. Arrastamento da calda III.2.5. Cuidados com o equipamento após aplicação III.2.6. Eliminação de excedentes de calda e de embalagens III.2.7. Operações de aplicação de PF III.2.8. Boas práticas de segurança e saúde no trabalho BLOCO IV",
        "Armazenamento, transporte e acidentes com produtos fitofarmacêuticosIV.1 Armazenamento e transporte de pequenas quantidades de produtos fitofarmacêuticos IV.1.1. Condições e características dos locais de armazenamento de produtos fitofarmacêuticos IV.1.2. Perigos e segurança durante o armazenamento. Sinalização. IV.1.3. Perigos e segurança no transporte de pequenas quantidades de produtos fitofarmacêuticos IV.2 Acidentes com produtos fitofarmacêuticos IV.2.1. Prevenção de acidentes IV.2.2. Acidentes de trabalho IV.2.3. Medidas de primeiros socorros Avaliação e encerramentoAvaliação de conhecimentos Avaliação de conhecimentos",
        "Prova teórica escritaAvaliação de reação e encerramento Avaliação de reação Encerramento"
      ],
      "formadores": [
        {
          "nome": "Carlos Manuel da Cunha Carvalho Marques",
          "biografia": "Licenciado em Engenharia Agronómica e Mestre em Enologia e Viticultura. Atualmente presta consultoria a explorações agrícolas nas operações de tratamentos fitossanitários e na calibração e inspeção de equipamentos de pulverização. Ministrou várias formções na área agricola e florestal, nomeadamente as UFCD's 4552, 9998, COTS (35h/50h), ADCAPF e APF.",
          "foto_url": "https://castelform.pt/ficheiros/e11547.jpg"
        },
        {
          "nome": "Maria Helena Dias Soares",
          "biografia": "Bacharelato em Engenharia Agro-Pecuária e Pós-Garduação em Agricultura Biológica. Ministrou diversas formações na area agricola presenciais e online, nomeadamente as UFCD's 9263, 6281, 11026, 926, 6290. É sócia da Associação Portuguesa de Horticultura e da Sociedade da Ciências Agrárias de Portugal.",
          "foto_url": "https://castelform.pt/ficheiros/e0.jpg"
        }
      ],
      "detalhe": {
        "inicio": "02/03/2026",
        "fim": "13/04/2026"
      },
      "resumo": {
        "horario": "2ª a 6ª das 18:30 às 22:30 / Sábado e Domingo das 09:00 às 17:00",
        "local": "Junta de Freguesia de Arentim e Cunha (Braga)"
      },
      "apresentacao": null,
      "metodologia": "Activa, centrada no participante, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de casos e trabalhos de grupo",
      "condicoes_inscricao": "Idade igual ou superior a 18 anos;Escolaridade mínima obrigatória; Situação Profissional:Activos: trabalhadores por conta de outrém, trabalhadores por conta própria ou em situação de desemprego que exercem actividade agrícola a tempo inteiro ou parcial (agricultores empresários e não empresários, trabalhadores agrícolas permanentes e eventuais, mão de obra agrícola familiar) Outros critérios:Exercer ou vir a exercer actividade relacionada com a aplicação de produtos fitofarmacêuticos",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "Semana 102-03-2026 - 2ª feira - 18:30 - 22:30 - 4.0 H04-03-2026 - 4ª feira - 19:00 - 22:30 - 3.5 H06-03-2026 - 6ª feira - 19:00 - 22:30 - 3.5 HSemana 211-03-2026 - 4ª feira - 19:00 - 22:30 - 3.5 H13-03-2026 - 6ª feira - 19:00 - 22:30 - 3.5 HSemana 318-03-2026 - 4ª feira - 19:00 - 22:30 - 3.5 H20-03-2026 - 6ª feira - 19:00 - 22:30 - 3.5 HSemana 425-03-2026 - 4ª feira - 19:00 - 22:30 - 3.5 H27-03-2026 - 6ª feira - 19:00 - 22:30 - 3.5 HSemana 502-04-2026 - 5ª feira - 19:30 - 22:30 - 3.0 H04-04-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 16:00 - 6.0 HSemana 611-04-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 16:00 - 6.0 HSemana 713-04-2026 - 2ª feira - 19:30 - 22:30 - 3.0 H"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=310&accao=805",
      "id_curso": 310,
      "id_accao": 805,
      "titulo": "0757 - Folha de cálculo - funcionalidades avançadas",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c310.jpg",
      "objetivos": [
        "Executar ligações entre múltiplas folhas de cálculo.",
        "Efetuar a análise de dados.",
        "Automatizar ações através da utilização de macros.."
      ],
      "conteudos": [
        "Múltiplas folhas de cálculo Múltiplas folhas Reunião de folhas de cálculo Ligação entre folhas Resumo de dados Inserção de subtotais Destaques Relatórios Análise de dados Análise de dados em tabelas e listas",
        "Criação, ordenação e filtragem de dados",
        "Formulários Criação e formatação de uma tabela dinâmica Utilização de totais e subtotais Fórmulas em tabelas dinâmicas Elaboração de gráficos Macros Macros pré",
        "definidas Macros de personalização das barras de ferramentas Criação e gravação de uma macro Atribuição de uma macro a um botão Execução de uma macro"
      ],
      "formadores": [
        {
          "nome": "Ricardo Costa",
          "biografia": "(n. 1978). Licenciado em Economia. A sua experiência profissional na área da Informática tem sido desenvolvida desde 2002 até ao presente. Atualmente desempenho funções com formador e professor na área das TIC e Robótica. Integra a equipa de formadores da Castelform, onde nos últimos 4 anos (entre nov. 2020 e maio de 2024), lecionou 17 ações de Excel Avançado e 5 de PowerBI, envolvendo mais de 500 formandos, tendo obtido avaliação de satisfação 4,9 (excelente), na escala de 1 a 5",
          "foto_url": "https://castelform.pt/ficheiros/e7679.jpg"
        }
      ],
      "detalhe": {
        "inicio": "03/03/2026",
        "fim": "26/03/2026"
      },
      "resumo": {
        "horario": "Pós laboral (19h30-23h00 e 19h30-23h30)",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=357&accao=760",
      "id_curso": 357,
      "id_accao": 760,
      "titulo": "Cálculo do IVA com recurso a aplicações informáticas de contabilidade",
      "area_formacao": "Gestão e Administração",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a760.jpg",
      "objetivos": [
        "Capacitar os formandos para as aplicações informáticas utilizadas em contabilidade, seja nas organizações, seja a nível da vida pessoal, explorando suas diversas possibilidades e funcionalidades, incluindo a apresentação de softwares específicos (ex: TOC Online), como aplicações de contabilidade Opensource e os sites oficiais para apoio ao cálculo do IVA a pagar/receber, otimizando processos e melhoria da eficiência operacional, de conformidade legal e de rentabilidade financeira.."
      ],
      "conteudos": [
        "Aplicações informáticas As aplicações informáticas e as organizações Aspossibilidades das aplicações informáticasAplicação informática Apresentação do software Aplicação de contabilidade"
      ],
      "formadores": [
        {
          "nome": "Andrea Braga",
          "biografia": "Licenciatura em Fiscalidade (2007). Contabilista Certificada (desde 2008). Contabilista numa Empresa de contabilidade (desde 2012). Formadora nos Cursos de Técnico/a de Contabilidade; Técnico/a de Apoio à Gestão; Técnicos/as Administrativos; Curso Técnico Especialista em Contabilidade e Fiscalidade; Formadora Certificada e E-Formadora. Formações relevantes: - Técnica Superior Segurança Trabalho (2020) - Gestão administrativa de Recursos Humanos: Rose Specialist (2022); Rose People (2023); - Formação em Ambiente Moodle (2024) e Gestão e Coordenação da Formação (2024)",
          "foto_url": "https://castelform.pt/ficheiros/e14646.jpg"
        }
      ],
      "detalhe": {
        "inicio": "03/03/2026",
        "fim": "24/03/2026"
      },
      "resumo": {
        "horario": "Pós laboral (19h30-23h00 e 19h30-23h30)",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": "Formato de Formação a Distância (FAD)Sessões Síncronas de âmbito teórico - das 19:00 às 22:30 h - com todo o grupo de formandos e formadora “on line”, na plataforma ZOOM.Com compomnete de prática simulada em que os formandos, de forma individual ou em salas partilhadas - desenvolvem tarefas e aplicações práticas sugeridas pela formadora.",
      "condicoes_inscricao": "Situação Profissional:Este curso destina-se apenas a \"trabalhadores por conta de outrém\" do setor privado (empresarial ou social).(NOTA: não são elegíveis desempregados, trabalhadores independentes ou funcionários públicos).Escolaridade mínima:3º ciclo ou 9º ano (completo).Documentação necessária:1. Cópia do cartão de cidadão ou do Visto de Residência, com autorização para trabalho (se candidato/a estrangeiro/a).2. Certificado Escolar ou Certificado de Habilitações Académicas (ou Declaração da instituição de Ensino onde completou com aproveitamenteo o último ano de escolaridade ou do ensino superior, atestando dessa forma as habilitações escolares ou académicas. No caso de formandos estrangeiros, o certificado de escolaridade ou o certificado de habilitações académicas deve estar reconhecido no sistema de ensino português (seja Escola Secundária, seja Universidade).3. Cópia do último recibo de vencimento.4. Declaração de Horário de trabalho (ex: de segunda a sexta feira, das 9:00h às 13:00h e das 14:00h às 18:00h).5. IBAN extraído do Netbanking onde deve constar o nome do/a candidato/a.Pagamento do subsidio de alimentação no valor de 6,00 euros/sessão, aos formandos que completem pelo menos 3 horas de formação no horário pós-laboral.",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia",
        "Avaliação",
        "Observações"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=366&accao=767",
      "id_curso": 366,
      "id_accao": 767,
      "titulo": "0393 - Internet como estratégia de marketing",
      "area_formacao": "Comércio",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a767.jpg",
      "objetivos": [
        "Capacitar os formandos para a gestão da presença empresarial das suas Entidades Empregadoras nas redes sociais.."
      ],
      "conteudos": [
        "Tipos de presença e funcionalidades específicas",
        "Tipologias de conteúdos",
        "Métricas e reporting",
        "Exemplos e análise de casos",
        "Instagram marketing o Tipos de presença e funcionalidades específicas o Tipologias de conteúdos o Métricas e reporting o Exemplos e análise de casos",
        "LinkedIn marketing o Tipos de presença e funcionalidades específicas o Tipologias de conteúdos o Métricas e reporting o Exemplos e análise de casos",
        "Youtube marketing o Tipos de presença e funcionalidades específicas o Tipologias de conteúdos o Métricas e reporting o Exemplos e análise de casos",
        "Outras redes sociais",
        "Gestão de sinergias entre diferentes redes sociais"
      ],
      "formadores": [
        {
          "nome": "Flávia Vilas Boas",
          "biografia": "Licenciada em Marketing pela Escola de Economia e Gestão da Universidade do Minho. Pós-graduada em gestão e negócios também pela Universidade do Minho. Foi responsável pelo gabinete de comunicação e imagem do Hospital de Braga, nomeadamente pelo Facebook do Banco de Sangue e do Linkedin do Hospital de Braga (2023). É responsável pela gestão de redes sociais e website de algumas empresas clientes, desde janeiro de 2022. Foi responsável pelo desenvolvimento de uma estratégia empresarial e de marketing para a Aplicação Shop&Go do Ikea. Finalista da Competição Nacional StartUp Programme Junior Achievement Portugal (JAP) - Desenvolvimento de uma ideia de negócio. Consultora e Formadora de Gestão de Redes Sociais. Formadora na Castelform nas temáticas de Marketing (Plano de negócios; Neuromarketing; Gestão de Redes Sociais), com a avaliação de 4,85 na escala de 1 a 5.",
          "foto_url": "https://castelform.pt/ficheiros/e12277.jpg"
        }
      ],
      "detalhe": {
        "inicio": "03/03/2026",
        "fim": "14/04/2026"
      },
      "resumo": {
        "horario": "Pós-laboral",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": "Esta formação tem como objetivo capacitar os formandos e as empresas/organizações a desenvolver estratégias de comunicação eficazes para as redes sociais, considerando as particularidades e funcionalidades de cada plataforma. Durante a formação, será abordada a gestão de redes sociais e a comunicação de produtos e serviços através de campanhas online, destacando a importância de uma abordagem estratégica e alinhada ao público-alvo de cada rede social.Além disso, serão explorados os elementos fundamentais do marketing digital, incluindo mídias sociais e anúncios digitais, como ferramentas indispensáveis para divulgar produtos e serviços de forma impactante.",
      "metodologia": "Curso de Formação a distancia: 50% síncrono (on line) e 50% assíncrono:- Nas sessões síncronas o/a formador/a apresenta os conteúdos teóricos e desenvolve aplicações práticas que os formandos poderão depois explorar e replicar.- Nas sessões assíncronas os formandos têm a possibilidade de desenvolver as propostas de trabalho sugeridas nas sessões síncronas, para testar os conhecimentos adquiridos.",
      "condicoes_inscricao": "Ativos/as empregados/as (por conta de outrem do setor privado com ou sem fins lucrativos), maiores de 18 anos, com escolaridade igual ou superior ao 9º ano.Cumpridos os critérios de elegibilidade, a seleção é efetuada por ordem de inscrição.Os formandos necessitam de computador com microfone, câmara e acesso à Internet.Documentação necessária:- Cópia do Certificado de Habilitações;- Cópia do último recibo de vencimento;- Declaração da entidade empregadora com horário de trabalho, assinada, carimbada e datada;- Comprovativo de IBAN em nome do/a formando/a.",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "Terças e Quintas Feiras- Sessões síncronas: das 19:30-23:30 horas ou das 19:30-23:00 horas"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Apresentação",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Objetivos Específicos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia",
        "Avaliação",
        "Observações"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=367&accao=768",
      "id_curso": 367,
      "id_accao": 768,
      "titulo": "0754 - Processador de texto",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a768.jpg",
      "objetivos": [
        "Elaborar, editar e imprimir documentos.Introduzir elementos gráficos em documentos.Elaborar e editar documentos longos.."
      ],
      "conteudos": [
        "Processador de texto – introdução Janela principal Inserção de texto (teclado) Modos de visualização básicos AjudaOperações básicas Criação, gravação e abertura de documentos Seleção de texto Anulação e repetição de açõesFormatações Formatações globais do documento Formatação do tipo de letra Formatações de parágrafo Utilização das tabelas pré",
        "definidas Criação de listas Limites e sombreadosEdição e revisão de texto Múltiplos documentos abertos Cópia do texto Verificação ortográfica Comando “localizar e substituir”Impressão Impressão de documentos, envelopes e etiquetasTabulações, tabelas e colunas Definir tabulações Criação, modificação e formatação de tabelas Divisão do texto em colunasMelhorar o aspeto visual Símbolos Caixas de texto Desenho, importação de imagens, inserção de formas automáticasDocumentos longos Quebras de página e de seleção Cabeçalhos e rodapés EstilosPercorrer o documento rapidamente Divisão do ecrã Marcadores e referências cruzadas Legendas e notas de rodapé Criação de índice Destaques Visualização do mapa de um documento Junção de documentos"
      ],
      "formadores": [],
      "detalhe": {
        "inicio": "03/03/2026",
        "fim": "14/04/2026"
      },
      "resumo": {
        "horario": "19:30-22:30 (com 2 sessões das 19:30 às 23:00)",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "03/03/2026",
        "14/04/2026",
        "03/03/2026",
        "14/04/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=62&accao=787",
      "id_curso": 62,
      "id_accao": 787,
      "titulo": "Conduzir e Operar com o trator em Segurança (COTS) (UFCD 9596)",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a787.jpg",
      "objetivos": [
        "Complementar os conhecimentos teóricos e práticos dos participantes sobre a condução e operação de tratores em segurança tendo em vista a melhoria do seu desempenho na via pública e na exploração e a redução da sinistralidade.."
      ],
      "conteudos": [
        "Acidentes com tratores em Portugal:",
        "Caraterização geral",
        "dados estatísticos",
        "Acidentes e mortalidade na via pública",
        "incidência, tipo de acidentes e principais causas",
        "Acidentes e mortalidade na exploração",
        "incidência, tipo de acidentes e principais causasCondução e prevenção rodoviária com veículos agrícolas",
        "Código da Estrada, Código do trabalho e Normas aplicáveis:",
        "Habilitação para a condução de tratores agrícolas",
        "Princípios gerais de trânsito e de segurança rodoviária",
        "Condutor e o seu estado físico e psicológico",
        "Condutor e o veículo",
        "Condutor e os outros utentes da via",
        "Condutor, a via e os outros fatores externos",
        "Condutor e o conhecimento do veiculo, aptidões e comportamentos",
        "Legislação aplicávelVeículo seguro",
        "equipamento de segurança e proteção do trator:",
        "Homologação",
        "Declaração CE de Conformidade. Marcação CE. Manual de instruções",
        "Manual de instruções – consulta, verificações e manutenções periódicas do veículo",
        "Estruturas de proteção",
        "cabine, quadro, arco de S. António",
        "Sistema de retenção e cinto de segurança",
        "Protetores de órgãos ativos e quentes",
        "Extintor",
        "Sinalização luminosa rotativa",
        "Espelhos retrovisores",
        "Caixa de primeiros socorrosEquipamento de proteção individual:",
        "Descrição, características e função de cada elemento de proteção",
        "Cuidados particulares com o vestuário a usar em função das máquinas a operarCondução e operação com o trator em segurança:",
        "Principais mandamentos de segurança com o trator",
        "Cuidados a ter antes de acionar e começar a trabalhar e no acesso ao trator",
        "Posição do operador para conduzir o trator ou operar comandos periféricos",
        "Cuidados a ter com o trator acionado",
        "Cuidados a ter na condução do trator, adequada às do tráfego, do piso e das condições climatéricas",
        "Cuidados a ter com outras pessoas",
        "Cuidados a ter no engate de máquinas e alfaias aos três pontos do hidráulico",
        "Cuidados a ter no engate do reboque e dispositivos de segurança",
        "Condução do trator na via publica – sem e com reboque, sem e com maquinas montadas, semi",
        "montadas ou rebocadas",
        "Cuidados a ter para evitar o reviramento ou o capotamento do tratorCondução do trator em condições perigosas e operar com orgãos ativos:",
        "Condução e operação em terreno acidentado",
        "Condução e operação do trator com carregador frontal",
        "Condução e operação do trator com reboque carregado e descarregado",
        "Cuidados a ter com o uso da báscula do reboque",
        "Operação com a TDF (tomada de força) – sistemas mecânicos de segurança para o veio e, de proteção para o operador",
        "Operação com o sistema hidráulico",
        "Velocidade no trator adequada às condições do piso e das condições climatéricas",
        "Travagem do trator; utilização do sistema de travagem; combinação da travagem com a utilização da caixa de velocidades",
        "Respeito pelas distâncias de segurança relativamente a cômoros, valas e precipíciosBoas práticas de segurança na condução, operação e engate/desengate de reboques e semi",
        "reboques e outras máquinas agrícolas e saúde no trabalho agrícola"
      ],
      "formadores": [
        {
          "nome": "Carlos Manuel da Cunha Carvalho Marques",
          "biografia": "Licenciado em Engenharia Agronómica e Mestre em Enologia e Viticultura. Atualmente presta consultoria a explorações agrícolas nas operações de tratamentos fitossanitários e na calibração e inspeção de equipamentos de pulverização. Ministrou várias formções na área agricola e florestal, nomeadamente as UFCD's 4552, 9998, COTS (35h/50h), ADCAPF e APF.",
          "foto_url": "https://castelform.pt/ficheiros/e11547.jpg"
        }
      ],
      "detalhe": {
        "inicio": "03/03/2026",
        "fim": "01/04/2026"
      },
      "resumo": {
        "horario": "Dias úteis (18:30-22:30) + Sábados e 1 dia útil (9:00-17:00)",
        "local": "Amares - APCB - Associação de Paralisia Cerebral de Braga (Carrazedo)"
      },
      "apresentacao": null,
      "metodologia": "Ativa, Centrada no participante, baseada na experiência e participação dos formandos, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de caso, trabalho individual e de grupo. A formação prática será realizada em campo.",
      "condicoes_inscricao": "Apresentar a seguinte documentação na fase de inscrição:1- Cópia do Certificado de Escolaridade ou de Habilitações Académicas2- Comprovativo de situação profissional: a) Recibo de Vencimento do ultimo mês (se trabalhadores por conta de outrem) b) Declaração de Inicio de Atividade + RVE ou Fatura recente (se trabalhadores por conta própria)Declaração do IEFP em como se encontra desempregado/a e inscrito/a à procura de emprego ou, em alternativa, com comprovativo da Segurança Social em como está desempregado (pode ser obtido via Segurança Social Direta - PDF de Extrato de Remunerações). 3- Cópia da Carta de Condução que habilite à Condução de Veículos Agrícolas (Carta de ligeiros ou pesados)4- Cópia do Cartão de CidadãoOutras condições de inscrição e seleção:N.º de formandos máximo: 16Idade: = 18 anos Habilitações literárias:. Escolaridade obrigatória, nos termos dos n.º 3 do artigo 7.º, do Anexo do Despacho n.º 5756/2020, de 26 de maio.. De acordo com alínea b1) do n.º 3, do artigo 7.º, do Anexo, do referido despacho, podem ser ainda aceites formandos que não disponham de escolaridade obrigatória, desde que comprovem saber ler, escrever e interpretar um texto.Outros requisitos:. Carta de condução da Categoria B, C ou D;. Título de condução que habilite a conduzir veículos agrícolas, quando o seu titular pretenda atualizar conhecimentos.",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "Semana 103-03-2026 - 3ª feira - 18:30 - 22:30 - 4.0 H05-03-2026 - 5ª feira - 19:00 - 22:30 - 3.5 HSemana 210-03-2026 - 3ª feira - 19:00 - 22:30 - 3.5 H12-03-2026 - 5ª feira - 19:00 - 22:30 - 3.5 H14-03-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 319-03-2026 - 5ª feira - 19:00 - 22:30 - 3.5 H21-03-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 426-03-2026 - 5ª feira - 18:30 - 22:30 - 4.0 H28-03-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 501-04-2024 - 4ª feira - 9:00 - 17:30 - 7 H - dia já confirmado pela DRAPN"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=2&accao=819",
      "id_curso": 2,
      "id_accao": 819,
      "titulo": "Processos e métodos de proteção fitossanitária e de aplicação de produtos fitofarmacêuticos - UFCD 6281",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c2.jpg",
      "objetivos": [
        "Capacitar os participantes para a manipulação e aplicação segura de produtos fitofarmacêuticos, minimizando os riscos para o aplicador, o ambiente, espécies e organismos não visados e o consumidor, de acordo com os princípios da protecção integrada.."
      ],
      "conteudos": [
        "Introdução ao curso 1. Apresentação do grupo 2. Levantamento de expectativas dos participantes 3. Apresentação do programa de acção BLOCO I",
        "Princípios gerais de proteção das culturasI.1 Meios de protecção das culturas",
        "controlo de doenças, pragas e infestantes I.1.1. Luta biológica I.1.2. Luta cultural I.1.3. Luta genética I.1.4. Luta biotécnica I.1.5. Luta química I.2 Proteção integrada I.2.1. Evolução da protecção das plantas I.2.2. Legislação específica I.2.3. Princípios gerais de proteção integrada I.2.4. Estimativa do risco e modelos de previsão I.2.5. Nível económico de ataque (NEA) I.2.6. Tomada de decisão I.2.7. Luta química",
        "Seleção de produtos fitofarmacêuticos I.2.8. Registo dos tratamentos realizados (caderno de campo) I.3 Produção integrada I.3.1. Princípios da PRODI I.3.2. Estratégia de produção I.3.3. Principais técnicas de produção I.3.4. Regulamentação e registosI.4 Agricultura biológica I.4.1. Princípios gerais I.4.2. Regulamento Comunitário relativo à Agricultura Biológica BLOCO II",
        "Segurança na utilização de produtos fitofarmacêuticos, sistemas regulamentares e redução do risco II.1 Produtos fitofarmacêiticos II.1.1. Definição de produto fitofarmacêutico II.1.2. Classificação química II.1.3. Modos de ação II.1.4. Formulação II.2 Sistemas regulamentares dos PF II.2.1. Homologação dos produtos fitofarmacêuticos II. 2.2. Produtos ilegais",
        "sua identificação II.2.3. Distribuição, venda e aplicação II.2.4. Gestão de resíduos de embalagens e de excedentes II.2.5. Outra legislação aplicável ou complementar II.3. Segurança na utilização dos produtos fitofarmacêuticos II.3.1. Aspetos toxicológicos inerentes à manipulação e aplicação dos produtos fitofarmacêuticos II.3.2. Símbolos toxicológicos e ecotoxicológicos II.3.3. Informação e leitura do rótulo II.3.4. Equipamento de proteção individual (EPI) II.3.5. Relação entre o EPI e as diferentes características dos produtos fitofarmacêuticos II.3.6. Sintomas de intoxicação com produtos fitofarmacêuticos II.4 Redução do risco no manuseamento e aplicação de produtos fitofarmacêuticos II.4.1. Verificação das condições de trabalho, condições atmosféricas, material de aplicação a utilizar, leitura do rótulo II.4.2. Cuidados com a preparação da calda II.4.3. Noção de dose e de concentração da calda II.4.4. Utilização do EPI correcto II.4.5. Boas práticas de segurança e saúde no trabalho II.5 Redução do risco para o ambiente, espécies e organismos não visados II.5.1. Impacte no ambiente do uso de produtos fitofarmacêuticos II.5.2. Riscos para as espécies e os organismos não visados resultantes da aplicação dos produtos fitofarmacêuticos II.5.3. Preparação da calda II.5.4. Eliminação de excedentes de calda II.5.5. Lavagem do equipamento de aplicação II.5.6. Gestão de embalagens e produtos obsoletos II.5.7. Boas práticas de segurança e saúde no trabalho II.6 Redução do risco para o consumidor II.6.1. Noção de resíduo II.6.2. Limite Máximo de Resíduo II.6.3. Intervalo de segurança II.6.4. Exposição do consumidor e cumprimento das indicações do rótulo II.6.5. Controlo de resíduos BLOCO III",
        "Máquinas de aplicação de produtos fitofarmacêuticos e técnicas de aplicaçãoIII.1. Máquinas de aplicação",
        "pulverizadores, atomizadores e polvilhadores III.1.1. Tipos, constituição e funcionamento III.1.2. Equipamentos combinados de mobilização, sementeira e tratamento fitossanitário III.1.3. Critérios para a seleção das máquinas de aplicação III.1.4. Engate das máquinas ao trator e regulações comuns III.1.5. Inspeção do equipamento e verificação do estado de funcionamento III.1.6. Técnicas de calibração e regulação das máquinas de aplicação III.1.7. Limpeza, conservação e manutenção do material de aplicação III.1.8. Operações de engate ao trator e regulação, de calibração e regulação de máquinas de aplicação e de limpeza, conservação e manutenção III.1.9. Boas práticas de segurança e saúde no trabalhoIII.2. Preparação da calda e técnicas de aplicação III.2.1. Cálculo de doses, concentrações e volumes de calda com herbicidas, inseticidas, fungicidas e outros produtos fitofarmacêuticos III.2.2. Preparação da calda III.2.3. Técnicas de aplicação III.2.4. Arrastamento da calda III.2.5. Cuidados com o equipamento após aplicação III.2.6. Eliminação de excedentes de calda e de embalagens III.2.7. Operações de aplicação de PF III.2.8. Boas práticas de segurança e saúde no trabalho BLOCO IV",
        "Armazenamento, transporte e acidentes com produtos fitofarmacêuticosIV.1 Armazenamento e transporte de pequenas quantidades de produtos fitofarmacêuticos IV.1.1. Condições e características dos locais de armazenamento de produtos fitofarmacêuticos IV.1.2. Perigos e segurança durante o armazenamento. Sinalização. IV.1.3. Perigos e segurança no transporte de pequenas quantidades de produtos fitofarmacêuticos IV.2 Acidentes com produtos fitofarmacêuticos IV.2.1. Prevenção de acidentes IV.2.2. Acidentes de trabalho IV.2.3. Medidas de primeiros socorros Avaliação e encerramentoAvaliação de conhecimentos Avaliação de conhecimentos",
        "Prova teórica escritaAvaliação de reação e encerramento Avaliação de reação Encerramento"
      ],
      "formadores": [
        {
          "nome": "Isabel Maria Ferreira Leandro Vilela",
          "biografia": "Licenciada em Engª Agricola em 1994 pela UTAD. Formadora desde 1994 tendo já ministrado dezenas de ações de formação a diversos publicos-Alvo nas áreas agricolas. Formadora especialista em Mecanização agrícola, Aplicação de Produtos Fitofarmacêuticos (APF); viticultura; Fruticultura e Equipamentos motomanuais. È empresária agrícola com exploração viticola e frutícola.",
          "foto_url": "https://castelform.pt/ficheiros/e1702.jpg"
        },
        {
          "nome": "Sílvia Pereira",
          "biografia": "(n. 1978). Licenciada em Engenharia Agronómica pel Instituto Politécnico de Bragança. Desde nov. de2001 assume funções de Técnica de viticultura nas Caves Vale do Rodo, CRL. Desde 2003 foi formadora de diversos APFs, COTs e Operação com equipamentos motomanuais. Frequentou diversos cursos específicos relacionados com APF (AMETPP; ADCAPF, DCAPF, na Consultua) e possui curso de “Técnica de Higiene e Segurança no Trabalho (Consultua, 2000), exercendo consultoria e formação na área de HST, designadamente com equipamentos motomanuais",
          "foto_url": "https://castelform.pt/ficheiros/e2755.jpg"
        }
      ],
      "detalhe": {
        "inicio": "06/03/2026",
        "fim": "30/03/2026"
      },
      "resumo": {
        "horario": "2ª a 6ª das 18:30 às 22:30 / Sábado e Domingo das 09:00 às 17:00",
        "local": "JF de Penajóia"
      },
      "apresentacao": null,
      "metodologia": "Activa, centrada no participante, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de casos e trabalhos de grupo",
      "condicoes_inscricao": "Idade igual ou superior a 18 anos;Escolaridade mínima obrigatória; Situação Profissional:Activos: trabalhadores por conta de outrém, trabalhadores por conta própria ou em situação de desemprego que exercem actividade agrícola a tempo inteiro ou parcial (agricultores empresários e não empresários, trabalhadores agrícolas permanentes e eventuais, mão de obra agrícola familiar) Outros critérios:Exercer ou vir a exercer actividade relacionada com a aplicação de produtos fitofarmacêuticos",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "Semana 106-03-2026 - 6ª feira - 14:00 - 17:30 e das 19:00 - 22:30 - 7.0 H07-03-2026 - Sábado - 14:00 - 17:30 e das 19:00 - 22:30 - 7.0 H08-03-2026 - Domingo - 14:00 - 17:30 e das 19:00 - 22:30 - 7.0 HSemana 209-03-2026 - 2ª feira - 18:30 - 22:30 - 4.0 H10-03-2026 - 3ª feira - 18:30 - 22:30 - 4.0 HSemana 318-03-2026 - 4ª feira - 18:30 - 22:30 - 4.0 HSemana 428-03-2026 - Sábado - 14:00 - 17:30 e das 19:00 - 22:00 - 6.5 H29-03-2026 - Domingo - 14:00 - 17:30 e das 19:00 - 22:00 - 6.5 HSemana 530-03-2026 - 2ª feira - 18:30 - 22:30 - 4.0 H"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=365&accao=759",
      "id_curso": 365,
      "id_accao": 759,
      "titulo": "Power BI",
      "area_formacao": "Ciências Informáticas",
      "duracao_total": "25 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a759.jpg",
      "objetivos": [
        "-Transformar dados e criar métricas.-Interpretar a linguagem Data Analysis Expressions (DAX).."
      ],
      "conteudos": [
        "Introdução à transformação de dados",
        "Transformação de dados",
        "Função Calculate",
        "Relações eficazmente",
        "Medidas semi",
        "aditivas",
        "Introdução ao DAX no Power BI Desktop",
        "Inteligência de Tempo e Medidas em DAX",
        "Introdução à otimização de desempenho",
        "Desempenho de medidas, relacionamentos e visuais",
        "Variáveis para melhorar o desempenho e a resolução de problemas",
        "Redução de cardinalidade",
        "Otimização dos modelos DirectQuery com armazenamento ao nível da tabela",
        "Criação de gestão de agregações"
      ],
      "formadores": [
        {
          "nome": "Ricardo Dias",
          "biografia": "(n. 1971). Bacharelato em Gestão Informática - Ramo Informática de Gestão (Instituto Politécnico da Guarda). ECDL – Carta Europeia de Condução em Informática. Foi sócio-gerente e fundador da Empresa especializada no desenvolvimento da Plataforma Mestreclique - Gestão Integrada de Formação/ Consultoria. Atualmente é Formador e Consultor em Sistemas de Informação, com predominância na Plataforma Mestreclique, Excel e Power BI e ainda formação-ação para empresas",
          "foto_url": "https://castelform.pt/ficheiros/e87.jpg"
        }
      ],
      "detalhe": {
        "inicio": "10/03/2026",
        "fim": "31/03/2026"
      },
      "resumo": {
        "horario": "19:30-23:00",
        "local": "Formação a Distância (FAD)"
      },
      "apresentacao": null,
      "metodologia": null,
      "condicoes_inscricao": null,
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "10/03/2026",
        "31/03/2026",
        "10/03/2026",
        "31/03/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=381&accao=796",
      "id_curso": 381,
      "id_accao": 796,
      "titulo": "Técnico/a Auxiliar de Saúde (EFA)",
      "area_formacao": "Saúde - Programas não Classificados Noutra Área de Formação",
      "duracao_total": "2020 horas",
      "imagem_url": "https://castelform.pt/ficheiros/a796.jpg",
      "objetivos": [
        "Desenvolver as competências profissionais, éticas e legais necessárias ao desempenho qualificado do/a Técnico/a Auxiliar de Saúde, assegurando a compreensão das suas atividades, responsabilidades, direitos e deveres, bem como a capacidade de atuar de forma segura, supervisionada, proativa e adequada aos diferentes contextos, públicos e normas institucionais no âmbito dos cuidados de saúde.."
      ],
      "conteudos": [],
      "formadores": [],
      "detalhe": {
        "inicio": "16/03/2026",
        "fim": "31/12/2027"
      },
      "resumo": {
        "horario": "09:00-13:00/14:00-18:00",
        "local": "Braga (local a confirmar)"
      },
      "apresentacao": "O/A Técnico/a Auxiliar de Saúde é o/a profissional que auxilia na prestação de cuidados de saúde aos utentes, na recolha e transporte de amostras biológicas, na limpeza, higienização e transporte de roupas, materiais e equipamentos, na limpeza e higienização dos espaços e no apoio logístico e administrativo das diferentes unidades e serviços de saúde, sob orientações do profissional de saúde.",
      "metodologia": null,
      "condicoes_inscricao": "Idade superior a 21 anosEmpregados e desempregadosMínimo 9º ano e máximo 12º ano incompleto",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "16/03/2026",
        "16/03/2026",
        "31/12/2027"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Apresentação",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=2&accao=816",
      "id_curso": 2,
      "id_accao": 816,
      "titulo": "Processos e métodos de proteção fitossanitária e de aplicação de produtos fitofarmacêuticos - UFCD 6281",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c2.jpg",
      "objetivos": [
        "Capacitar os participantes para a manipulação e aplicação segura de produtos fitofarmacêuticos, minimizando os riscos para o aplicador, o ambiente, espécies e organismos não visados e o consumidor, de acordo com os princípios da protecção integrada.."
      ],
      "conteudos": [
        "Introdução ao curso 1. Apresentação do grupo 2. Levantamento de expectativas dos participantes 3. Apresentação do programa de acção BLOCO I",
        "Princípios gerais de proteção das culturasI.1 Meios de protecção das culturas",
        "controlo de doenças, pragas e infestantes I.1.1. Luta biológica I.1.2. Luta cultural I.1.3. Luta genética I.1.4. Luta biotécnica I.1.5. Luta química I.2 Proteção integrada I.2.1. Evolução da protecção das plantas I.2.2. Legislação específica I.2.3. Princípios gerais de proteção integrada I.2.4. Estimativa do risco e modelos de previsão I.2.5. Nível económico de ataque (NEA) I.2.6. Tomada de decisão I.2.7. Luta química",
        "Seleção de produtos fitofarmacêuticos I.2.8. Registo dos tratamentos realizados (caderno de campo) I.3 Produção integrada I.3.1. Princípios da PRODI I.3.2. Estratégia de produção I.3.3. Principais técnicas de produção I.3.4. Regulamentação e registosI.4 Agricultura biológica I.4.1. Princípios gerais I.4.2. Regulamento Comunitário relativo à Agricultura Biológica BLOCO II",
        "Segurança na utilização de produtos fitofarmacêuticos, sistemas regulamentares e redução do risco II.1 Produtos fitofarmacêiticos II.1.1. Definição de produto fitofarmacêutico II.1.2. Classificação química II.1.3. Modos de ação II.1.4. Formulação II.2 Sistemas regulamentares dos PF II.2.1. Homologação dos produtos fitofarmacêuticos II. 2.2. Produtos ilegais",
        "sua identificação II.2.3. Distribuição, venda e aplicação II.2.4. Gestão de resíduos de embalagens e de excedentes II.2.5. Outra legislação aplicável ou complementar II.3. Segurança na utilização dos produtos fitofarmacêuticos II.3.1. Aspetos toxicológicos inerentes à manipulação e aplicação dos produtos fitofarmacêuticos II.3.2. Símbolos toxicológicos e ecotoxicológicos II.3.3. Informação e leitura do rótulo II.3.4. Equipamento de proteção individual (EPI) II.3.5. Relação entre o EPI e as diferentes características dos produtos fitofarmacêuticos II.3.6. Sintomas de intoxicação com produtos fitofarmacêuticos II.4 Redução do risco no manuseamento e aplicação de produtos fitofarmacêuticos II.4.1. Verificação das condições de trabalho, condições atmosféricas, material de aplicação a utilizar, leitura do rótulo II.4.2. Cuidados com a preparação da calda II.4.3. Noção de dose e de concentração da calda II.4.4. Utilização do EPI correcto II.4.5. Boas práticas de segurança e saúde no trabalho II.5 Redução do risco para o ambiente, espécies e organismos não visados II.5.1. Impacte no ambiente do uso de produtos fitofarmacêuticos II.5.2. Riscos para as espécies e os organismos não visados resultantes da aplicação dos produtos fitofarmacêuticos II.5.3. Preparação da calda II.5.4. Eliminação de excedentes de calda II.5.5. Lavagem do equipamento de aplicação II.5.6. Gestão de embalagens e produtos obsoletos II.5.7. Boas práticas de segurança e saúde no trabalho II.6 Redução do risco para o consumidor II.6.1. Noção de resíduo II.6.2. Limite Máximo de Resíduo II.6.3. Intervalo de segurança II.6.4. Exposição do consumidor e cumprimento das indicações do rótulo II.6.5. Controlo de resíduos BLOCO III",
        "Máquinas de aplicação de produtos fitofarmacêuticos e técnicas de aplicaçãoIII.1. Máquinas de aplicação",
        "pulverizadores, atomizadores e polvilhadores III.1.1. Tipos, constituição e funcionamento III.1.2. Equipamentos combinados de mobilização, sementeira e tratamento fitossanitário III.1.3. Critérios para a seleção das máquinas de aplicação III.1.4. Engate das máquinas ao trator e regulações comuns III.1.5. Inspeção do equipamento e verificação do estado de funcionamento III.1.6. Técnicas de calibração e regulação das máquinas de aplicação III.1.7. Limpeza, conservação e manutenção do material de aplicação III.1.8. Operações de engate ao trator e regulação, de calibração e regulação de máquinas de aplicação e de limpeza, conservação e manutenção III.1.9. Boas práticas de segurança e saúde no trabalhoIII.2. Preparação da calda e técnicas de aplicação III.2.1. Cálculo de doses, concentrações e volumes de calda com herbicidas, inseticidas, fungicidas e outros produtos fitofarmacêuticos III.2.2. Preparação da calda III.2.3. Técnicas de aplicação III.2.4. Arrastamento da calda III.2.5. Cuidados com o equipamento após aplicação III.2.6. Eliminação de excedentes de calda e de embalagens III.2.7. Operações de aplicação de PF III.2.8. Boas práticas de segurança e saúde no trabalho BLOCO IV",
        "Armazenamento, transporte e acidentes com produtos fitofarmacêuticosIV.1 Armazenamento e transporte de pequenas quantidades de produtos fitofarmacêuticos IV.1.1. Condições e características dos locais de armazenamento de produtos fitofarmacêuticos IV.1.2. Perigos e segurança durante o armazenamento. Sinalização. IV.1.3. Perigos e segurança no transporte de pequenas quantidades de produtos fitofarmacêuticos IV.2 Acidentes com produtos fitofarmacêuticos IV.2.1. Prevenção de acidentes IV.2.2. Acidentes de trabalho IV.2.3. Medidas de primeiros socorros Avaliação e encerramentoAvaliação de conhecimentos Avaliação de conhecimentos",
        "Prova teórica escritaAvaliação de reação e encerramento Avaliação de reação Encerramento"
      ],
      "formadores": [
        {
          "nome": "Carlos Manuel da Cunha Carvalho Marques",
          "biografia": "Licenciado em Engenharia Agronómica e Mestre em Enologia e Viticultura. Atualmente presta consultoria a explorações agrícolas nas operações de tratamentos fitossanitários e na calibração e inspeção de equipamentos de pulverização. Ministrou várias formções na área agricola e florestal, nomeadamente as UFCD's 4552, 9998, COTS (35h/50h), ADCAPF e APF.",
          "foto_url": "https://castelform.pt/ficheiros/e11547.jpg"
        },
        {
          "nome": "Maria Helena Dias Soares",
          "biografia": "Bacharelato em Engenharia Agro-Pecuária e Pós-Garduação em Agricultura Biológica. Ministrou diversas formações na area agricola presenciais e online, nomeadamente as UFCD's 9263, 6281, 11026, 926, 6290. É sócia da Associação Portuguesa de Horticultura e da Sociedade da Ciências Agrárias de Portugal.",
          "foto_url": "https://castelform.pt/ficheiros/e0.jpg"
        }
      ],
      "detalhe": {
        "inicio": "17/03/2026",
        "fim": "09/05/2026"
      },
      "resumo": {
        "horario": "2ª a 6ª das 18:30 às 22:30 / Sábado e Domingo das 09:00 às 17:00",
        "local": "APCB - Amares"
      },
      "apresentacao": null,
      "metodologia": "Activa, centrada no participante, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de casos e trabalhos de grupo",
      "condicoes_inscricao": "Idade igual ou superior a 18 anos;Escolaridade mínima obrigatória; Situação Profissional:Activos: trabalhadores por conta de outrém, trabalhadores por conta própria ou em situação de desemprego que exercem actividade agrícola a tempo inteiro ou parcial (agricultores empresários e não empresários, trabalhadores agrícolas permanentes e eventuais, mão de obra agrícola familiar) Outros critérios:Exercer ou vir a exercer actividade relacionada com a aplicação de produtos fitofarmacêuticos",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "Semana 117-03-2026 - 3ª feira - 18:30 - 22:30 - 4.0 HSemana 224-03-2026 - 3ª feira - 18:30 - 22:30 - 4.0 HSemana 331-03-2026 - 3ª feira - 19:00 - 22:30 - 3.5 H02-04-2026 - 5ª feira - 19:00 - 22:30 - 3.5 HSemana 407-04-2026 - 3ª feira - 19:00 - 22:30 - 3.5 H09-04-2026 - 5ª feira - 19:00 - 22:30 - 3.5 HSemana 514-04-2026 - 3ª feira - 19:00 - 22:30 - 3.5 H16-04-2026 - 5ª feira - 19:00 - 22:30 - 3.5 HSemana 621-04-2026 - 3ª feira - 19:00 - 22:30 - 3.5 H23-04-2026 - 5ª feira - 19:00 - 22:30 - 3.5 H25-04-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 HSemana 702-05-2026 - Sábado - 09:00 - 13:00 e das 14:00 - 17:00 - 7.0 H"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Datas de Realização",
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    },
    {
      "url": "https://castelform.pt/informacaocurso.aspx?id=2&accao=815",
      "id_curso": 2,
      "id_accao": 815,
      "titulo": "Processos e métodos de proteção fitossanitária e de aplicação de produtos fitofarmacêuticos - UFCD 6281",
      "area_formacao": "Produção Agrícola e Animal",
      "duracao_total": "50 horas",
      "imagem_url": "https://castelform.pt/ficheiros/c2.jpg",
      "objetivos": [
        "Capacitar os participantes para a manipulação e aplicação segura de produtos fitofarmacêuticos, minimizando os riscos para o aplicador, o ambiente, espécies e organismos não visados e o consumidor, de acordo com os princípios da protecção integrada.."
      ],
      "conteudos": [
        "Introdução ao curso 1. Apresentação do grupo 2. Levantamento de expectativas dos participantes 3. Apresentação do programa de acção BLOCO I",
        "Princípios gerais de proteção das culturasI.1 Meios de protecção das culturas",
        "controlo de doenças, pragas e infestantes I.1.1. Luta biológica I.1.2. Luta cultural I.1.3. Luta genética I.1.4. Luta biotécnica I.1.5. Luta química I.2 Proteção integrada I.2.1. Evolução da protecção das plantas I.2.2. Legislação específica I.2.3. Princípios gerais de proteção integrada I.2.4. Estimativa do risco e modelos de previsão I.2.5. Nível económico de ataque (NEA) I.2.6. Tomada de decisão I.2.7. Luta química",
        "Seleção de produtos fitofarmacêuticos I.2.8. Registo dos tratamentos realizados (caderno de campo) I.3 Produção integrada I.3.1. Princípios da PRODI I.3.2. Estratégia de produção I.3.3. Principais técnicas de produção I.3.4. Regulamentação e registosI.4 Agricultura biológica I.4.1. Princípios gerais I.4.2. Regulamento Comunitário relativo à Agricultura Biológica BLOCO II",
        "Segurança na utilização de produtos fitofarmacêuticos, sistemas regulamentares e redução do risco II.1 Produtos fitofarmacêiticos II.1.1. Definição de produto fitofarmacêutico II.1.2. Classificação química II.1.3. Modos de ação II.1.4. Formulação II.2 Sistemas regulamentares dos PF II.2.1. Homologação dos produtos fitofarmacêuticos II. 2.2. Produtos ilegais",
        "sua identificação II.2.3. Distribuição, venda e aplicação II.2.4. Gestão de resíduos de embalagens e de excedentes II.2.5. Outra legislação aplicável ou complementar II.3. Segurança na utilização dos produtos fitofarmacêuticos II.3.1. Aspetos toxicológicos inerentes à manipulação e aplicação dos produtos fitofarmacêuticos II.3.2. Símbolos toxicológicos e ecotoxicológicos II.3.3. Informação e leitura do rótulo II.3.4. Equipamento de proteção individual (EPI) II.3.5. Relação entre o EPI e as diferentes características dos produtos fitofarmacêuticos II.3.6. Sintomas de intoxicação com produtos fitofarmacêuticos II.4 Redução do risco no manuseamento e aplicação de produtos fitofarmacêuticos II.4.1. Verificação das condições de trabalho, condições atmosféricas, material de aplicação a utilizar, leitura do rótulo II.4.2. Cuidados com a preparação da calda II.4.3. Noção de dose e de concentração da calda II.4.4. Utilização do EPI correcto II.4.5. Boas práticas de segurança e saúde no trabalho II.5 Redução do risco para o ambiente, espécies e organismos não visados II.5.1. Impacte no ambiente do uso de produtos fitofarmacêuticos II.5.2. Riscos para as espécies e os organismos não visados resultantes da aplicação dos produtos fitofarmacêuticos II.5.3. Preparação da calda II.5.4. Eliminação de excedentes de calda II.5.5. Lavagem do equipamento de aplicação II.5.6. Gestão de embalagens e produtos obsoletos II.5.7. Boas práticas de segurança e saúde no trabalho II.6 Redução do risco para o consumidor II.6.1. Noção de resíduo II.6.2. Limite Máximo de Resíduo II.6.3. Intervalo de segurança II.6.4. Exposição do consumidor e cumprimento das indicações do rótulo II.6.5. Controlo de resíduos BLOCO III",
        "Máquinas de aplicação de produtos fitofarmacêuticos e técnicas de aplicaçãoIII.1. Máquinas de aplicação",
        "pulverizadores, atomizadores e polvilhadores III.1.1. Tipos, constituição e funcionamento III.1.2. Equipamentos combinados de mobilização, sementeira e tratamento fitossanitário III.1.3. Critérios para a seleção das máquinas de aplicação III.1.4. Engate das máquinas ao trator e regulações comuns III.1.5. Inspeção do equipamento e verificação do estado de funcionamento III.1.6. Técnicas de calibração e regulação das máquinas de aplicação III.1.7. Limpeza, conservação e manutenção do material de aplicação III.1.8. Operações de engate ao trator e regulação, de calibração e regulação de máquinas de aplicação e de limpeza, conservação e manutenção III.1.9. Boas práticas de segurança e saúde no trabalhoIII.2. Preparação da calda e técnicas de aplicação III.2.1. Cálculo de doses, concentrações e volumes de calda com herbicidas, inseticidas, fungicidas e outros produtos fitofarmacêuticos III.2.2. Preparação da calda III.2.3. Técnicas de aplicação III.2.4. Arrastamento da calda III.2.5. Cuidados com o equipamento após aplicação III.2.6. Eliminação de excedentes de calda e de embalagens III.2.7. Operações de aplicação de PF III.2.8. Boas práticas de segurança e saúde no trabalho BLOCO IV",
        "Armazenamento, transporte e acidentes com produtos fitofarmacêuticosIV.1 Armazenamento e transporte de pequenas quantidades de produtos fitofarmacêuticos IV.1.1. Condições e características dos locais de armazenamento de produtos fitofarmacêuticos IV.1.2. Perigos e segurança durante o armazenamento. Sinalização. IV.1.3. Perigos e segurança no transporte de pequenas quantidades de produtos fitofarmacêuticos IV.2 Acidentes com produtos fitofarmacêuticos IV.2.1. Prevenção de acidentes IV.2.2. Acidentes de trabalho IV.2.3. Medidas de primeiros socorros Avaliação e encerramentoAvaliação de conhecimentos Avaliação de conhecimentos",
        "Prova teórica escritaAvaliação de reação e encerramento Avaliação de reação Encerramento"
      ],
      "formadores": [
        {
          "nome": "Custódio de Sousa Oliveira",
          "biografia": "Mestre em Agricultura Biológica. Foi Director Geral da Adega Cooperativa de Braga, Crl entre 1994 e 2001. Téncico Agricola na Cavagri-Cooperativa Agrícola do Alto Cávado, Crl, entre 2001 e 2009. Participação nos workshops regionais do Projecto “Bio-Regiões\", dinamizado pela Rede Rural Nacional e Rede Internacional das Bio-Regiões (INNER). Formador desde 2010, já lecionou diversas formações na área agricola. Formador homologado pela DRAPN em cursos APF e COTS, desde 2013.",
          "foto_url": "https://castelform.pt/ficheiros/e4493.jpg"
        },
        {
          "nome": "Maria Helena Dias Soares",
          "biografia": "Bacharelato em Engenharia Agro-Pecuária e Pós-Garduação em Agricultura Biológica. Ministrou diversas formações na area agricola presenciais e online, nomeadamente as UFCD's 9263, 6281, 11026, 926, 6290. É sócia da Associação Portuguesa de Horticultura e da Sociedade da Ciências Agrárias de Portugal.",
          "foto_url": "https://castelform.pt/ficheiros/e0.jpg"
        }
      ],
      "detalhe": {
        "inicio": "16/04/2026",
        "fim": "05/05/2026"
      },
      "resumo": {
        "horario": "2ª a 6ª das 18:30 às 22:30 / Sábado e Domingo das 09:00 às 17:00",
        "local": "UF de Este (São Pedro e São Mamede)"
      },
      "apresentacao": null,
      "metodologia": "Activa, centrada no participante, utilizando diversas técnicas de ensino como, exposição dialogada, demonstração, simulação, estudo de casos e trabalhos de grupo",
      "condicoes_inscricao": "Idade igual ou superior a 18 anos;Escolaridade mínima obrigatória; Situação Profissional:Activos: trabalhadores por conta de outrém, trabalhadores por conta própria ou em situação de desemprego que exercem actividade agrícola a tempo inteiro ou parcial (agricultores empresários e não empresários, trabalhadores agrícolas permanentes e eventuais, mão de obra agrícola familiar) Outros critérios:Exercer ou vir a exercer actividade relacionada com a aplicação de produtos fitofarmacêuticos",
      "destinatarios": null,
      "requisitos": null,
      "certificacao": null,
      "calendario": [
        "16/04/2026",
        "16/04/2026",
        "05/05/2026"
      ],
      "imagens": [],
      "cards_extraidas": [
        "Condições de Inscrição",
        "Área de Formação",
        "Objetivos",
        "Conteúdos Programáticos",
        "Formador(es)",
        "Metodologia"
      ]
    }
  ]
}